Repository: Du4ert/udc-plugin
Catalog: locale/*/locale.po
Languages: ru_ru

# plugins.pubIds.udc.displayName
source: UDC
ru_ru: Модуль «УДК»

# plugins.pubIds.udc.description
source: This plugin enables the assignment of UDC to articles in OJS.
ru_ru: Включает присвоение УДК статьям в OJS.

# plugins.pubIds.udc.readerDisplayName
source: UDC
ru_ru: УДК

# plugins.pubIds.udc.manager.settings.description
source: Please configure the UDC plugin to be able to manage and use UDCs in OJS:
ru_ru: Пожалуйста, настройте модуль «УДК», чтобы иметь возможность использовать УДК в OJS и управлять ими:

# plugins.pubIds.udc.editor.udc
source: UDC
ru_ru: УДК

# plugins.pubIds.udc.editor.udc.description
source: Enter UDC of the article
ru_ru: Введите УДК статьи.

# plugins.pubIds.udc.editor.assigned
source: The UDC is assigned to this {$pubObjectType}.
ru_ru: УДК присвоен {$pubObjectType}.

# plugins.pubIds.udc.editor.udcCustomIdentifierNotUnique
source: The given UDC is already in use for another published item. Please enter a unique UDC for each item.
ru_ru: Заданный УДК уже используется для другого опубликованного элемента. Пожалуйста, введите уникальный УДК для каждого элемента.

# plugins.pubIds.udc.editor.clearObjectsUdc
source: Clear
ru_ru: Удалить

# plugins.pubIds.udc.editor.clearObjectsUdc.confirm
source: Are you sure you wish to delete the existing UDC?
ru_ru: Вы уверены, что хотите удалить существующий УДК?

# plugins.pubIds.udc.editor.assignUdc
source: Assign the UDC {$pubId} to this {$pubObjectType}
ru_ru: Присвоить УДК {$pubId} {$pubObjectType}

# plugins.pubIds.udc.editor.assignUdc.pattern
source: The UDC {$pubId} cannot be assigned because it contains an unresolved pattern.
ru_ru: УДК {$pubId} не может быть присвоен, так как он содержит не замененный шаблон.

# plugins.pubIds.udc.editor.assignUdc.assigned
source: The UDC {$pubId} has been assigned.
ru_ru: УДК {$pubId} был присвоен.

# plugins.pubIds.udc.editor.preview.publication
source: The UDC for this publication will be {$udc}.
ru_ru: UDC для этой публикации будет {$udc}.

# plugins.pubIds.udc.editor.preview.publication.none
source: A UDC has not been assigned to this publication.
ru_ru: УДК не был присвоен этой публикации.

# plugins.pubIds.udc.manager.settings.udcAssignJournalWide
source: Assign UDCs
ru_ru: Присвоить УДК
